Autodesk.Revit.DB.ExtensibleStorage.Entity.Clear(System.String)
Resets the field to its default value.
Remarks:
The default value is zero for numeric fields, invalid value for identifiers and
entities, and empty for strings and containers.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to clear.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
-or-
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Entity is invalid.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.Clear(Autodesk.Revit.DB.ExtensibleStorage.Field)
Resets the field to its default value.
Remarks:
The default value is zero for numeric fields, invalid value for identifiers and
entities, and empty for strings and containers.
field:
The field to clear.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
-or-
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.RecognizedField(Autodesk.Revit.DB.ExtensibleStorage.Field)
Checks whether a Field belongs to the same Schema as this Entity.
field:
The Field to check.
Returns:
True if the Field belongs to the same Schema as this Entity.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.WriteAccessGranted
Checks whether this Entity may be stored by the current add-in.
Returns:
True if write access is allowed.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.ReadAccessGranted
Checks whether this Entity may be retrieved by the current add-in.
Returns:
True if read access is allowed.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.IsValid
Checks whether this Entity has a live Schema corresponding to it.
Remarks:
Invalid entities may be used as token values. E.g., setting an invalid subentity
is equivalent to deleting the stored one.
Returns:
True if the Entity is valid.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExtensibleStorage.Entity.SchemaGUID
The GUID of the Schema describing this Entity.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.Schema
The Schema describing this Entity.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.Set``1(System.String,``0,Autodesk.Revit.DB.DisplayUnitType)
Stores the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; no conversions will be performed inside this method (but may be
performed on the returned value). The types for containers are
IList for arrays and
IDictionary for maps.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to update.
displayUnits:
The units from which the value will be converted before storing. Must match the UnitType
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid floating-point value.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Set``1(Autodesk.Revit.DB.ExtensibleStorage.Field,``0,Autodesk.Revit.DB.DisplayUnitType)
Stores the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; no conversions will be performed inside this method (but may be
performed on the returned value). The types for containers are
IList for arrays and
IDictionary for maps.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
field:
The field to update.
displayUnits:
The units from which the value will be converted before storing. Must match the UnitType
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid floating-point value.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Set``1(System.String,``0)
Stores the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; no conversions will be performed inside this method (but may be
performed on the returned value). The types for containers are
IList for arrays and
IDictionary for maps.
Note that when string values are specified as map keys,
they are case-insensitive.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to update.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits parameter is required for floating-point fields.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid floating-point value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
String is too long; exceeds max length of 16mb characters.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Set``1(Autodesk.Revit.DB.ExtensibleStorage.Field,``0)
Stores the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; no conversions will be performed inside this method (but may be
performed on the returned value). The types for containers are
IList for arrays and
IDictionary for maps.
Note that when string values are specified as map keys,
they are case-insensitive.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
field:
The field to update.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits parameter is required for floating-point fields.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid floating-point value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
String is too long; exceeds max length of 16mb characters.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Get``1(System.String,Autodesk.Revit.DB.DisplayUnitType)
Retrieves the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; no conversions will be performed inside this method (but may be
performed on the returned value). The types for containers are
IList for arrays and
IDictionary for maps.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to retrieve.
displayUnits:
The units to which the value will be converted before returning. Must match the UnitType
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents reading.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.Get``1(Autodesk.Revit.DB.ExtensibleStorage.Field,Autodesk.Revit.DB.DisplayUnitType)
Retrieves the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; no conversions will be performed inside this method (but may be
performed on the returned value). The types for containers are
IList for arrays and
IDictionary for maps.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
field:
The field to retrieve.
displayUnits:
The units to which the value will be converted before returning. Must match the UnitType
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents reading.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.Get``1(System.String)
Retrieves the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; no conversions will be performed inside this method (but may be
performed on the returned value). The types for containers are
IList for arrays and
IDictionary for maps.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to retrieve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits parameter is required for floating-point fields.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents reading.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.Get``1(Autodesk.Revit.DB.ExtensibleStorage.Field)
Retrieves the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; no conversions will be performed inside this method (but may be
performed on the returned value). The types for containers are
IList for arrays and
IDictionary for maps.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
field:
The field to retrieve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits parameter is required for floating-point fields.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents reading.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.#ctor(System.Guid)
Creates a new Entity corresponding to the Schema of the specified GUID.
Remarks:
You can store the newly created Entity in an Element or in another Entity.
If you do not have write access to the Schema, an exception will be thrown.
If the GUID does not correspond to a known Schema, the Entity will be invalid
and an exception will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The GUID does not correspond to any Schema in memory.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Writing of Entities of this Schema is not allowed to the current add-in.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.#ctor(Autodesk.Revit.DB.ExtensibleStorage.Schema)
Creates a new Entity corresponding to the Schema.
Remarks:
You can store the newly created Entity in an Element or in another Entity.
If you do not have write access to the Schema, an exception will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Writing of Entities of this Schema is not allowed to the current add-in.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.#ctor
The default-constructed Entity is invalid.
Remarks:
Invalid entities may be used as token values. E.g., setting an invalid subentity
is equivalent to deleting the stored one.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.#ctor(Autodesk.Revit.DB.ExtensibleStorage.Entity)
Constructs a new copy of the input ESEntity object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity
An object stored in the Extensible Storage framework. An Entity is described by a Schema,
which serves both to identify an Entity, and to describe its contents (Fields).
Remarks:
An Entity is similar to an object in most object-oriented languages, while a Schema is the
class of that object.
The Get and Set methods are central - they provide access to the fields of the Entity.
Note that an unitialized Entity retrieved from an Element or another Entity (if it has not
been created yet) will be represented as an invalid entity, not null.
If an Element containing an Entity is split (e.g., a wall split), the Entity and its data will exist
in both new Elements.
If an Element containing an Entity is copied, the Element copy will also contain a copy of the Entity and its data.
If an Entity stores an ElementId, and the Element with that ElementId is deleted, the stored
ElementId will automatically be set to ElementId.InvalidElementId (-1).
Since:
2012